/**
 * 播放列表
 * @type {Array}
 * 请用数组来定义总列表
 * 再用二维数组定义每个列表
 * 其中列表里的每首歌需用对象定义
 * 请在每个列表中的第一个元素定义列表信息（必须位于第一位）
 * 列表信息必须有一个basic属性，值为true
 * 还要有一个name属性，值为列表名称
 * 可选参数为singer、image，用于为定义的该属性的歌曲调用
 * 每首歌必须有name、src、lrc三个属性
 * src为歌曲相对于index.html的相对路径或绝对路径
 * 可选singer和image属性
 * 在每首歌没有定义singer或image时将使用列表的singer或image
 * 请确保一定有一个被定义
 * 其中name为歌曲名称
 * src为歌曲文件路径
 * lrc为歌词，请用\n或\r将每行歌词隔开，否则无法识别
 */
var mplayer_song = [[
	{
		"basic":true,
		"name":"2016单曲集",
		"singer":"许嵩",
		"img":"https://y.gtimg.cn/music/photo_new/T001R300x300M000000CK5xN3yZDJt.jpg"
	},
	{
		"name":"江湖",
		"src":"http://ws.stream.qqmusic.qq.com/108344251.m4a?fromtag=46",
		"img":"http://imgcache.qq.com/music/photo/album_500/65/500_albumpic_1588165_0.jpg",
		"lrc":"[ti:江湖（网剧《画江湖之不良人》主题曲）][ar:许嵩][al:江湖][by:许嵩][offset:0][00:00.08]江湖 （《画江湖之不良人》超级网剧主题曲） - 许嵩[00:10.00]词：许嵩[00:11.00]曲：许嵩[00:43.55]今夕是何夕[00:46.76]晚风过花庭[00:49.10]飘零 予人乐后飘零[00:56.41]故地是何地[00:59.44]死生不复回[01:02.12]热血 风干在旧恨里[01:08.16]衣锦夜行[01:10.20]当一生尘埃落定[01:14.19]飞鸽来急[01:16.56]那落款沾染血迹[01:21.07]夜半嘱小徒复信[01:24.99]言师已故去[01:27.88]星云沉默江湖里[01:34.83]孤雁飞去 红颜来相许[01:40.24]待到酒清醒[01:42.61]她无影 原来是梦里[01:47.52]恩怨散去[01:50.65]刀剑已归隐[01:53.07]敬属江上雨[01:55.45]寒舟里 我独饮[02:24.99]衣锦夜行[02:27.06]当一生尘埃落定[02:31.03]飞鸽来急[02:33.43]那落款沾染血迹[02:37.81]夜半嘱小徒复信[02:41.81]言师已故去[02:44.65]星云沉默江湖里[02:51.64]孤雁飞去 红颜来相许[02:57.11]待到酒清醒[02:59.35]她无影 原来是梦里[03:04.28]恩怨散去[03:07.48]刀剑已归隐[03:09.81]敬属江上雨[03:12.27]寒舟里 我独饮[03:36.42]孤雁飞去 红颜来相许[03:41.71]待到酒清醒[03:44.16]她无影 原来是梦里[03:48.96]恩怨散去[03:52.22]刀剑已归隐[03:54.51]敬属江上雨[03:56.97]寒舟里 我独饮[04:04.73]我独饮"
	},
	{
		"name":"雅俗共赏",
		"src":"http://ws.stream.qqmusic.qq.com/106034300.m4a?fromtag=46",
		"lrc":"[ar:许嵩]\n[ti:雅俗共赏]\n[00:00.45]许嵩 - 雅俗共赏\n[00:02.05]词曲：许嵩\n[00:16.05]是否每一部戏都看得完整场\n[00:22.95]是否每一天过得都有多难忘\n[00:29.90]表情迟钝可能因为比较爱想\n[00:36.85]不擅长眉目表达\n[00:42.61]总在盼望 总在失望\n[00:46.06]日子还不都这样\n[00:49.56]俗的无畏 雅的轻狂\n[00:53.06]还不都是一副臭皮囊\n[00:59.86]他们说快写一首情歌雅俗共赏\n[01:04.31]落笔传神还要容易传唱\n[01:07.71]上得厅堂也下得厨房\n[01:10.81]就像我一直在找的姑娘\n[01:14.67]快写一首情歌雅俗共赏\n[01:18.17]打完字谜还要接着打榜\n[01:21.62]如果胡同弄堂全都播放\n[01:24.82]气韵里居然添了些孤芳自赏\n[01:46.90]是否每一场美梦醒来都很爽\n[01:53.26]是否每一次成熟都徒增了业障\n[02:00.11]比痛和痒更多的\n[02:03.36]是不痛不痒\n[02:07.31]所以我爱进剧场\n[02:13.06]总在盼望 总在失望\n[02:16.56]日子还不都这样\n[02:19.86]俗的无畏 雅的轻狂\n[02:23.41]还不都是一副臭皮囊\n[02:29.62]他们说快写一首情歌雅俗共赏\n[02:34.72]落笔传神还要容易传唱\n[02:38.22]上得厅堂也下得厨房\n[02:41.27]就像我一直在找的姑娘\n[02:45.17]快写一首情歌雅俗共赏\n[02:48.62]打完字谜还要接着打榜\n[02:52.08]如果胡同弄堂全都播放\n[02:55.23]气韵里居然添了些孤芳自赏\n[03:02.98]谁的故事有营养\n[03:06.08]大俗或大雅的都在理直气壮\n[03:09.98]洒狗血或白雪的现场\n[03:13.83]都邀我观赏\n[03:15.43]还真是大方\n[03:20.03]快写一首情歌雅俗共赏\n[03:23.39]落笔传神还要容易传唱\n[03:26.84]上得厅堂也下得厨房\n[03:30.29]就像我一直在找的姑娘\n[03:33.89]有没有一种生活雅俗共赏\n[03:37.29]情节起伏跌宕让人向往\n[03:40.79]满纸荒唐中窥见满脸沧桑\n[03:44.09]触到神经就要懂得鼓掌\n[03:47.44]别说一不在乎二没期望\n[03:50.90]太超脱 中枪中奖感觉会一样"
	},
	{
		"name":"燕归巢",
		"src":"http://ws.stream.qqmusic.qq.com/105575471.m4a?fromtag=46",
		"lrc":"[ar:许嵩]\n[ti:燕归巢]\n[00:08.97]许嵩 - 燕归巢\n[00:15.54]作词：许嵩\n[00:18.96]作曲：许嵩\n[00:20.96]制作人：许嵩\n[00:48.09]雨后江岸天破晓\n[00:51.49]老舟新客知多少\n[00:54.99]远山见竹林芳草\n[00:58.04]晨风抚绿了芭蕉\n[01:02.19]寒梅落尽把冬了\n[01:05.74]衔春的燕想归巢\n[01:09.34]沿途的景 牵挂的人\n[01:12.89]两情迢迢\n[01:16.45]柳叶桨溅桃花浪\n[01:19.20]汀州里鹤眺远方\n[01:23.63]饮一盏岁月留香\n[01:26.23]唱一曲往事飞扬\n[01:30.80]山水间歌声回荡\n[01:34.40]回荡思念的滚烫\n[01:38.00]去年的家书两行\n[01:41.10]读来又热了眼眶\n[01:45.17]云水边静沐暖阳\n[01:48.47]烟波里久违的故乡\n[01:52.32]别来无恙\n[01:54.87]你在心上\n[02:28.41]雨后江岸天破晓\n[02:31.72]老舟新客知多少\n[02:35.28]远山见竹林芳草\n[02:38.34]晨风抚绿了芭蕉\n[02:42.50]寒梅落尽把冬了\n[02:46.05]衔春的燕想归巢\n[02:49.73]沿途的景 牵挂的人\n[02:53.20]两情迢迢\n[02:56.81]柳叶桨溅桃花浪\n[02:59.41]汀州里鹤眺远方\n[03:03.86]饮一盏岁月留香\n[03:06.62]唱一曲往事飞扬\n[03:11.07]山水间歌声回荡\n[03:14.68]回荡思念的滚烫\n[03:18.23]去年的家书两行\n[03:21.39]读来又热了眼眶\n[03:25.49]云水边静沐暖阳\n[03:28.79]烟波里久违的故乡\n[03:32.61]别来无恙\n[03:35.13]你在心上\n[03:40.73]儿时的窗 苍老的墙\n[03:44.18]是否偷换了方向\n[03:47.84]堂前的你和我相逢时\n[03:50.54]会沉默还是会诉尽衷肠\n[03:57.60]山水间歌声回荡\n[04:01.26]回荡思念的滚烫\n[04:04.76]去年的家书两行\n[04:07.82]读来又热了眼眶\n[04:11.89]云水边静沐暖阳\n[04:15.34]烟波里久违的故乡\n[04:19.93]别来无恙\n[04:21.48]你在心上\n[04:29.99]别来无恙\n[04:33.40]你在心上\n"
	}
]];
